app/controllers/articles_controller.rb

  def create
    @user = User.find(article_params[:user_id])
    @article = @user.articles.new(name: article_params[:name],
                                  description: article_params[:description])

    @article.locations.new(tracking: article_params[:tracking],
                           start_date: article_params[:start_date],
                           end_date: article_params[:end_date],
                           latitud: article_params[:latitud],
                           longitud: article_params[:longitud],
                           max_radius_alert: article_params[:max_radius_alert])
    if @article.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "1"], ["description", "t"], ["user_id", 1], ["created_at", 2016-09-25 17:40:49 UTC], ["updated_at", 2016-09-25 17:40:49 UTC]]
INSERT INTO "locations" ("tracking", "article_id", "start_date", "end_date", "created_at", "updated_at", "latitud", "longitud", "max_radius_alert") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"