app/controllers/messages_controller.rb

INSERT INTO "messages" ("motion", "created_at", "updated_at", "article_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["motion", true], ["created_at", 2016-09-24 21:56:06 UTC], ["updated_at", 2016-09-24 21:56:06 UTC], ["article_id", 1]]
---
  def create
    messages_params[:messages].each do |message|
      Message.create(article_id: message[:article_id],
                     motion: message[:motion],
                     latitud: message[:latitud],
                     longitud: message[:longitud],
                     radius: message[:radius],
                     message_time: message[:message_time])